'''
로또 구현하기 1
1부터 45 까지의 랜덤한 숫자를 6개 출력하는 코드를 작성하시오.
단, 수의 중복이 허용된다.

출력 예시
27
40
7
23
36
40

'''

# ===========================================================================
# TODO 1. random 라이브러리를 import를 사용해서 불러오세요.
?????? random

# ===========================================================================
# TODO 2. for문을 사용하고, 6번 반복하세요.
??? i in range(?):
# ===========================================================================
# TODO 3. a는 1부터 45까지의 랜덤한 숫자를 저장하도록 설정하고, a를 출력하세요.
    a = random.???????(?, ?)
    ?????(a)