'''
문제 05. 약수 구하기

어떤 수 a를 다른 수 b로 나누었을 때 나머지가 0이라면 a는 b로 나누어 떨어진다고 하며 b는 a의 약수라고 한다. 두 자연수 a와 b가 주어졌을 때, b가 a의 약수인지 아닌지 검사하는 프로그램을 만들어라.

두 수 a와 b가 개행(Enter) 으로 구분하여 입력된다.
단, b는 a보다 항상 작거나 같다.

이 경우, b가 a의 약수이면 True를 출력해 주고,
그렇지 않다면, a를 b로 나누었을 때의 나머지를 출력한다. 약수인 경우 나머지는 0이 된다.
'''

# 이곳 아래에 코드를 작성하세요.
# ===========================================================================
# TODO 1. 정수(int) 형태로 입력 받기
n = ???
m = ???
# ===========================================================================
# TODO 2. n과 m의 나머지를 구하는 코드를 작성
d = ???

# ===========================================================================
# TODO 3. n과 m의 나머지가 0이라면 약수! 약수가 아니라면 n을 m으로 나누었을 때의 나머지 출력!
?? ? == 0:
    print("True")
????:
    print(d)